INSERT INTO "Product"
(id, name, type) VALUES
(1, 'Яблоко', 'Фрукт'),
(2, 'Банан', 'Фрукт'),
(3, 'Огурец', 'Овощ'),
(4, 'Помидор', 'Овощ'),
(5, 'Арбуз', 'Ягода');

INSERT INTO "Request"
(id, text, count_received) VALUES
(1, '"Сколько стоит?"', 0),
(2, '"Какова калорийность?"', 0),
(3, '"Какая цена?"', 0),
(4, '"Стоимость?"', 0),
(5, '"Где купить?"', 0),
(6, '"Я хочу больше узнать об этом продукте"', 0),
(7, '"Сколько можно употреблять в день?"', 0),
(8, '"Какие интересные факты связаны с этим продуктом?"', 0),
(9, '"Расскажи рецепты"', 0);